# """
# ++++++++++++++++++++++++++++++++++++++++++++++++
# Списки
# ++++++++++++++++++++++++++++++++++++++++++++++++
# ================================================
# 1. Создание списков
# ================================================
cities = ["Москва", "Тверь", "Вологда"] # Создай список cities с элементами: "Москва", "Тверь", "Вологда".
numbers = [1, 2, 3, 4, 5] # Создай список numbers с целыми числами от 1 до 5.
mixed = [1, '1', True, 6.11] # Создай список mixed с элементами разных типов: число, строка, булево значение, вещественное число.
# ================================================
# 2. Доступ к элементам списка
# ================================================
print(cities[0]) # Выведи первый элемент списка cities.
print(numbers[-1]) # Выведи последний элемент списка numbers с помощью отрицательного индекса.
#print(cities[10]) # Попробуй получить элемент с индексом 10 из cities. Что произойдет? ! IndexError: list index out of range
# ================================================
# 3. Изменение элементов списка
# ================================================
numbers.insert(1, 10) # Замени второй элемент списка numbers на 10.
mixed.insert(5, "Python") # Замени последний элемент списка mixed на "Python".
print(mixed)
# ================================================
# 4. Функции для работы со списками
# ================================================
print(len(numbers)) # Выведи длину списка numbers.
print(max(numbers), min(numbers)) # Найди максимальное и минимальное значение в numbers.
print(sum(numbers)) # Вычисли сумму всех элементов списка numbers.
a = sorted(numbers) # Отсортируй список numbers по возрастанию и убыванию.
print(a)
a.sort(reverse=True)
print(a)
# ================================================
# 5. Операции со списками
# ================================================
b = ([1, 2, 3]) # Объедини два списка [1, 2, 3] и [4, 5].
c = ([4, 5])
d = b + c
print(d)
a = ["Python", "is", "awesome"] # Продублируй список ["Python", "is", "awesome"] три раза.
print(a * 3)
# ================================================
# 6. Проверка вхождения
# ================================================
print(numbers.count(3)) # Проверь, содержится ли число 3 в списке numbers.
print(3 in numbers)
print(cities.count("Москва")) # Проверь, содержится ли "Москва" в cities.
print("Москва" in cities)
print(mixed.count([1, 2])) # Проверь, содержится ли [1, 2] в mixed
print([1, 2] in mixed)
# ================================================
# 7. Удаление элементов
# ================================================
print(numbers.remove(2)) # Удали третий элемент из numbers.
print(numbers)
del cities[-1] # Удали последний элемент из cities с помощью del.
print(cities)
# ================================================
# 8. Дополнительное задание
# ================================================
a = list("Python") # Преобразуй строку "Python" в список символов.
print(a)
print(max(a)) # Найди максимальный и минимальный символ в этом списке.
print(min(a))
#print(sum(a)) # Попробуй сложить все элементы списка. Что произойдет? ! TypeError: unsupported operand type(s) for +: 'int' and 'str'
#
# ++++++++++++++++++++++++++++++++++++++++++++++++
# Срезы списков
# ++++++++++++++++++++++++++++++++++++++++++++++++
# ================================================
# 1. Создание и копирование списков
# ================================================
cities = ['msk', 'tmn', 'tver', 'texaco', 'havoline']# Создай список с городами.
b = cities.copy() # Создай копию списка с помощью среза.
print(b)
print(id(cities)) # Проверь, является ли оригинальный список и его копия разными объектами.
print(id(b)) # ================================================
# 2. Извлечение элементов с помощью срезов
# ================================================
print(cities[1:3]) # Выведи 2-й и 3-й элементы списка с городами.
print(cities[2:]) # Выведи все элементы, начиная с 3-го.
print(cities[:3]) # Выведи первые три элемента.
print(cities[:]) # Выведи весь список через срез.
print(cities[-3:-1]) # Используй отрицательные индексы для выбора последних двух элементов.
# ================================================
# 3. Использование шагов в срезах
# ================================================
print(cities[::2]) # Выведи каждый второй элемент списка с городам.
print(list(cities[::-1])) # Выведи список в обратном порядке.
print(list(cities[::-2])) # Выведи каждый второй элемент с конца.
# ================================================
# 4. Изменение элементов списка через срезы
# ================================================
cities.insert(1, "sochi") # Замени 2-й и 3-й элементы списка с городами на "Сочи" и "Нижний Новгород".
cities.insert(2, "nizh novg")
print(cities)
cities[1::2] = ["gorod"] * (len(cities)//2)  # Замени каждый второй элемент на "Город". ! СДЕЛАЛ ЧЕРЕЗ ЧАТГПТ!!!!
print(cities)
cities[1:3] = "Волгоград", "Омск" # Присвой новые значения кортежем: cities[1:3] = "Волгоград", "Омск".
print(cities)
# ================================================
# 5. Операции с объединением списков
# ================================================
lst1 = [1, 2, 3] # Объедини два списка [1, 2, 3] и [4, 5, 6].
lst2 = [4, 5, 6]
a = lst1 + lst2
print(a)
lst3 = ["Python", "rocks"] # Продублируй список ["Python", "rocks"] два раза.
print(lst3 *2)
# ================================================
# 6. Сравнение списков
# ================================================
print(lst1 == lst1) # Сравни [1, 2, 3] и [1, 2, 3] – равны ли они?
print([10, 5, 3] > [5, 10, 3]) # Проверь, что [10, 5, 3] > [5, 10, 3].
print([1, 2, 3] == [1, 2, "abc"]) # Попробуй сравнить [1, 2, 3] и [1, 2, "abc"]. Что произойдет? !не равно!
# ================================================
# 7. Дополнительное задание
# ================================================
chars = list("Python")# Создай список chars = list("Python").
print(max(chars)) # Выведи максимальный и минимальный символ в этом списке.
print(min(chars))
#print(sum(chars)) # Попробуй сложить все элементы списка chars. Объясни результат. ! строчные списочные значения не складываются
#
# ++++++++++++++++++++++++++++++++++++++++++++++++
# Методы списков
# ++++++++++++++++++++++++++++++++++++++++++++++++
# ================================================
# 1. Добавление элементов
# ================================================
numbers = [5, 10, 15] # Создай список numbers = [5, 10, 15].
numbers.append(20) # Добавь в конец списка число 20 с помощью append().
print(numbers)
numbers.insert(1, 7) # Вставь число 7 на второе место списка с помощью insert().
print(numbers)
numbers.append("Python") # Добавь строку "Python" в список numbers.
print(numbers)
# ================================================
# 2. Удаление элементов
# ================================================
numbers.remove(10) # Удали число 10 из списка с помощью remove().
print(numbers)
del numbers[-1] # Удали последний элемент списка и выведи его (pop()).
numbers.pop()
print(numbers)
numbers.pop(1) # Удали элемент с индексом 1 с помощью pop().
print(numbers)
numbers.clear()# Очисти весь список numbers.
print(numbers)
# ================================================
# 3. Копирование списков
# ================================================
letters = ["a", "b", "c"] # Создай список letters = ["a", "b", "c"].
a = letters.copy() # Создай копию списка с помощью copy() и list().
b = list(letters)
print(id(a)) # Проверь, являются ли оригинальный список и копия разными объектами.
print(id(b))
# ================================================
# 4. Поиск элементов
# ================================================
marks = [2, 3, 5, 3, 4, 5, 2, 3] # Создай список marks = [2, 3, 5, 3, 4, 5, 2, 3].
print(marks.count(3)) # Определи, сколько раз встречается число 3 в списке (count()).
print(marks.index(5)) # Найди индекс первого вхождения числа 5 (index()).
#print(marks.index()) # Проверь, содержится ли число 6 в списке перед вызовом index(). ! не понял
# ================================================
# 5. Изменение порядка элементов
# ================================================
nums = [8, 2, 5, 1, 7] # Создай список nums = [8, 2, 5, 1, 7].
nums.sort()# Отсортируй его по возрастанию (sort()).
print(nums)
nums.sort(reverse=True) # Отсортируй его по убыванию (sort(reverse=True)).
print(nums)
nums.reverse() # Разверни список (reverse()).
print(nums)
# ================================================
# 6. Сортировка строк
# ================================================
a = list('cities') # Создай список cities.
a.sort() # Отсортируй его в алфавитном порядке (sort()).
print(a)
a = list('cities') # Создай новый отсортированный список с sorted(), не изменяя оригинал.
a.sort()
print(a)
b = sorted(a)
print(b)
# ================================================
# 7. Дополнительное задание
# ================================================
chars = list("programming") # Создай список символов chars = list("programming").
print(chars.count("g")) # Определи количество вхождений буквы "g".
chars.reverse()
print(chars) # Разверни список символов (reverse()).
chars.sort()
print(chars) # Попробуй отсортировать список chars (sort()). Как изменится порядок букв? ! по алфавиту
# ++++++++++++++++++++++++++++++++++++++++++++++++
# Вложенные списки (массивы)
# ++++++++++++++++++++++++++++++++++++++++++++++++
# ================================================
# 1. Создание вложенного списка
# ================================================
matrix = [
    [1, 2, 3, 4],
    [5, 6, 7, 8],
    [9, 10, 11, 12]
] # Создай двумерный список matrix, содержащий 3 строки и 4 столбца со значениями от 1 до 12.
print(matrix) # Выведи всю матрицу на экран.
print(matrix[1]) # Выведи вторую строку.
print(matrix[2][0]) # Выведи первый элемент третьей строки.
# ================================================
# 2. Изменение элементов вложенного списка
# ================================================
matrix[0] = 0 # Замени все элементы первой строки на 0.
print(matrix)
matrix[1][3] = "Python" # Замени последний элемент второй строки на "Python".
print(matrix)
# """